// 在 replace 中使用捕获组
var s = "2015-5-1,- 2019-6-19,- 2000-04-28";
var reg = /(\d{4})-(\d{1,2})-(\d{1,2})/g;
var newStr1 = s.replace(reg, function (match, g1, g2, g3) {
  // console.log(match, g1, g2, g3);
  return `${g1}/${g2}/${g3}`;
})
console.log(newStr1); // 2015/5/1,- 2019/6/19,- 2000/04/28

/*
需求：年-月-日 ==> 年/月/日
参数：
  match：匹配结果
  g1：第一个捕获组
  g2：第二个捕获组
  g3：第三个捕获组
output：
  2015-5-1 2015 5 1
  2019-6-19 2019 6 19
  2000-04-28 2000 04 28
  2015/5/1,- 2019/6/19,- 2000/04/28
*/

// 在 replace 中使用捕获组 的另一种写法
var newStr2 = s.replace(reg, "$1/$2/$3"); // 利用特殊字符 $1 表示第一个捕获组 $2 ...
console.log(newStr2); // => 2015/5/1,- 2019/6/19,- 2000/04/28